// src/data.js

// Полный массив "businesses" с опциями
export const businesses = [
  {
    name: "Финансы",
    // cost: ['CPC', 'Бюджет на 1000 кликов', 'Extra metric', 'CPL']
    cost: ["60.00", "60000.00", "558.00", "2500.00"],
    options: [
      {
        name: "Кредиты (потребительские, автомобильные, ипотечные)",
        cost: ["130.00", "130000.00", "504.00", "3800.00"],
      },
      {
        name: "Скидочные сервисы",
        cost: ["28.00", "28000.00", "900.00", "480.00"],
      },
      {
        name: "Страхование (каско, осаго, имущества, здоровья)",
        cost: ["70.00", "70000.00", "486.00", "1600.00"],
      },
      {
        name: "Банковские услуги",
        cost: ["95.00", "95000.00", "360.00", "3000.00"],
      },
      {
        name: "Бухучет и аудит",
        cost: ["35.00", "35000.00", "315.00", "1500.00"],
      },
    ],
  },
  {
    name: "Бизнес",
    cost: ["65.00", "65000.00", "315.00", "1800.00"],
    options: [
      {
        name: "Франшизы",
        cost: ["50.00", "50000.00", "90.00", "4410.00"],
      },
      {
        name: "Сервисы для бизнеса (crm-системы, бух. Программы, системы автоматизации)",
        cost: ["60.00", "50000.00", "450.00", "1960.00"],
      },
      {
        name: "Бухучет и аудит",
        cost: ["35.00", "35000.00", "315.00", "1500.00"],
      },
    ],
  },
  {
    name: "Авто",
    cost: ["25.00", "25000.00", "162.00", "1280.00"],
    options: [
      {
        name: "Продажа авто (новые и подержанные, иностранные и отечественные)",
        cost: ["30.00", "30000.00", "162.00", "2290.00"],
      },
      {
        name: "Аренда авто",
        cost: ["55.00", "55000.00", "720.00", "1640.00"],
      },
      {
        name: "Автовыкуп",
        cost: ["300.00", "300000.00", "1350.00", "2980.00"],
      },
      {
        name: "Автосервис, СТО",
        cost: ["55.00", "55000.00", "900.00", "1640.00"],
      },
      {
        name: "Автозапчасти, аксессуары",
        cost: ["32.00", "18000.00", "468.00", "2200.00"],
      },
      {
        name: "Спецтехника",
        cost: ["35.00", "35000.00", "180.00", "1930.00"],
      },
      {
        name: "Транспортные услуги",
        cost: ["65.00", "65000.00", "333.00", "1920.00"],
      },
    ],
  },
  {
    name: "Товары",
    cost: ["12.00", "12000.00", "180.00", "975.00"],
    options: [
      {
        name: "Бытовая техника",
        cost: ["22.00", "22000.00", "126.00", "1640.00"],
      },
      {
        name: "Климатическая техника, кондиционеры, обогреватели",
        cost: ["22.00", "22000.00", "126.00", "1640.00"],
      },
      {
        name: "Электроника, оргтехника, компьютеры и телефоны",
        cost: ["22.00", "22000.00", "270.00", "1130.00"],
      },
      {
        name: "Одежда, обувь и аксессуары",
        cost: ["25.00", "15000.00", "216.00", "1640.00"],
      },
      {
        name: "Текстиль, галантерея",
        cost: ["22.00", "18000.00", "360.00", "1470.00"],
      },
      {
        name: "Спецодежда",
        cost: ["20.00", "20000.00", "405.00", "1060.00"],
      },
      {
        name: "Медицинские товары",
        cost: ["18.00", "18000.00", "1710.00", "1290.00"],
      },
      {
        name: "Автотовары",
        cost: ["30.00", "20000.00", "189.00", "1150.00"],
      },
      {
        name: "Детские товары",
        cost: ["24.00", "18000.00", "630.00", "1080.00"],
      },
      {
        name: "Товары для животных, зоотовары",
        cost: ["24.00", "18000.00", "1350.00", "890.00"],
      },
      {
        name: "Товары для спорта, туризма и отдыха",
        cost: ["19.00", "19000.00", "270.00", "640.00"],
      },
      {
        name: "Инструменты",
        cost: ["17.00", "17000.00", "270.00", "640.00"],
      },
      {
        name: "Товары для дома",
        cost: ["16.00", "16000.00", "180.00", "1120.00"],
      },
      {
        name: "Мебель",
        cost: ["27.00", "27000.00", "135.00", "1299.90"],
      },

      {
        name: "Растения оптом",
        cost: ["27.00", "27000.00", "135.00", "1499.90"],
      },

      {
        name: "Косметика",
        cost: ["19.00", "19000.00", "333.00", "1150.00"],
      },
      {
        name: "Книги",
        cost: ["16.00", "20000.00", "540.00", "980.00"],
      },
      {
        name: "Агро",
        cost: ["21.00", "18000.00", "270.00", "1360.00"],
      },
      {
        name: "Безопасность и видеонаблюдение",
        cost: ["55.00", "55000.00", "270.00", "1920.00"],
      },
      {
        name: "Товары для взрослых",
        cost: ["51.00", "51000.00", "306.00", "1870.00"],
      },
      {
        name: "Украшения",
        cost: ["47.00", "27000.00", "450.00", "1470.00"],
      },
      {
        name: "Рыбалка",
        cost: ["20.00", "20000.00", "270.00", "1070.00"],
      },
      {
        name: "Продукты питания, напитки",
        cost: ["20.00", "20000.00", "900.00", "980.00"],
      },
      {
        name: "Посуда",
        cost: ["14.00", "14000.00", "270.00", "1150.00"],
      },
      {
        name: "Игрушки",
        cost: ["17.00", "17000.00", "450.00", "770.00"],
      },
      {
        name: "Строительные товары, материалы",
        cost: ["27.00", "27000.00", "270.00", "1010.00"],
      },
      {
        name: "Ювелирные изделия, украшения, часы",
        cost: ["28.00", "28000.00", "90.00", "1920.00"],
      },
    ],
  },
  {
    name: "Доставка",
    cost: ["45.00", "45000.00", "900.00", "749.90"],
    options: [
      {
        name: "Доставка еды (суши, пицца, заказ продуктов на дом)",
        cost: ["48.00", "48000.00", "1341.00", "1470.00"],
      },
      {
        name: "Сухофрукты, орехи, мед",
        cost: ["18.00", "18000.00", "630.00", "1080.00"],
      },
      {
        name: "Доставка продуктов",
        cost: ["90.00", "80000.00", "900.00", "2250.00"],
      },
      {
        name: "Доставка воды",
        cost: ["27.00", "27000.00", "900.00", "1370.00"],
      },
      {
        name: "Доставка цветов",
        cost: ["85.00", "85000.00", "720.00", "1290.00"],
      },
      {
        name: "Доставка бетона, песка, щебня",
        cost: ["21.00", "21000.00", "720.00", "1490.00"],
      },
    ],
  },
  {
    name: "Недвижимость",
    cost: ["40.00", "40000.00", "261.00", "2849.60"],
    options: [
      {
        name: "Продажа",
        cost: ["33.00", "33000.00", "261.00", "1300.00"],
      },
      {
        name: "Аренда",
        cost: ["32.00", "32000.00", "261.00", "1390.00"],
      },

      {
        name: "Коммерческая недвижимость",
        cost: ["42.00", "42000.00", "261.00", "2690.00"],
      },
      {
        name: "Новостройки",
        cost: ["32.00", "32000.00", "261.00", "2390.00"],
      },
    ],
  },
  {
    name: "Строительство и ремонт",
    cost: ["14.00", "14000.00", "315.00", "650.00"],
    options: [
      {
        name: "Строительные услуги",
        cost: ["36.00", "26000.00", "315.00", "2060.00"],
      },
      {
        name: "Строительство домов под ключ",
        cost: ["46.00", "46000.00", "315.00", "3060.00"],
      },

      {
        name: "Установка окон",
        cost: ["46.00", "26000.00", "315.00", "3060.00"],
      },

      {
        name: "Кровельные работы",
        cost: ["36.00", "26000.00", "315.00", "2060.00"],
      },
      {
        name: "Ремонт и отделка",
        cost: ["42.00", "42000.00", "315.00", "2080.00"],
      },
      {
        name: "Натяжные потолки",
        cost: ["110.00", "110000.00", "630.00", "2440.00"],
      },
      {
        name: "Строительные материалы",
        cost: ["25.00", "25000.00", "270.00", "1020.00"],
      },
      {
        name: "Инженерные системы",
        cost: ["75.00", "75000.00", "135.00", "3500.00"],
      },
      {
        name: "Интерьер",
        cost: ["40.00", "40000.00", "225.00", "1740.00"],
      },
      {
        name: "Дизайн",
        cost: ["45.00", "45000.00", "180.00", "2580.00"],
      },
      {
        name: "Ландшафтный дизайн",
        cost: ["55.00", "55000.00", "180.00", "3280.00"],
      },
      {
        name: "Окна",
        cost: ["105.00", "105000.00", "450.00", "3590.00"],
      },
      {
        name: "Двери",
        cost: ["30.00", "30000.00", "450.00", "1140.00"],
      },
      {
        name: "Сантехника",
        cost: ["55.00", "55000.00", "270.00", "2120.00"],
      },
    ],
  },
  {
    name: "Мебель",
    cost: ["25.00", "25000.00", "180.00", "1599.90"],
    options: [
      {
        name: "Офисная мебель",
        cost: ["40.00", "40000.00", "180.00", "2800.00"],
      },
      {
        name: "Натяжные потолки",
        cost: ["110.00", "110000.00", "630.00", "2440.00"],
      },
      {
        name: "Матрасы",
        cost: ["42.00", "42000.00", "180.00", "2890.00"],
      },
      {
        name: "Интерьер",
        cost: ["41.00", "41000.00", "225.00", "2440.00"],
      },

      {
        name: "Коммерческая мебель",
        cost: ["31.00", "31000.00", "225.00", "1640.00"],
      },

      {
        name: "Кухонная мебель",
        cost: ["35.00", "45000.00", "180.00", "2099.90"],
      },
    ],
  },
  {
    name: "Образование",
    cost: ["33.00", "30000.00", "396.00", "950.10"],
    options: [
      {
        name: "Тренинги, семинары, повышение квалификации",
        cost: ["30.00", "30000.00", "549.00", "1950.00"],
      },
      {
        name: "Языковые школы",
        cost: ["75.00", "75000.00", "540.00", "1970.00"],
      },
      {
        name: "ВУЗ",
        cost: ["22.00", "22000.00", "234.00", "1120.00"],
      },
      {
        name: "Автошкола",
        cost: ["39.00", "39000.00", "450.00", "1420.00"],
      },
      {
        name: "Курсы",
        cost: ["30.00", "30000.00", "549.00", "1850.00"],
      },
    ],
  },
  {
    name: "Туризм и отдых",
    cost: ["15.00", "18000.00", "450.00", "599.60"],
    options: [
      {
        name: "Турфирмы",
        cost: ["22.00", "18000.00", "630.00", "890.00"],
      },
      {
        name: "Отели/гостиницы",
        cost: ["25.00", "25000.00", "270.00", "1120.00"],
      },
      {
        name: "Санатории",
        cost: ["16.00", "18000.00", "270.00", "850.00"],
      },
      {
        name: "Активный отдых, Охота и рыбалка",
        cost: ["20.00", "18000.00", "315.00", "1070.00"],
      },
    ],
  },
  {
    name: "Производство",
    cost: ["30.00", "30000.00", "450.00", "900.20"],
    options: [
      {
        name: "Промышленное производство, завод",
        cost: ["38.00", "18000.00", "450.00", "1290.00"],
      },
      {
        name: "Оборудование",
        cost: ["33.00", "33000.00", "360.00", "920.00"],
      },
      {
        name: "Промышленные материалы",
        cost: ["45.00", "45000.00", "360.00", "1580.00"],
      },
      {
        name: "Металлоконструкции",
        cost: ["39.00", "39000.00", "315.00", "1490.00"],
      },
      {
        name: "Деревообработка",
        cost: ["32.00", "19000.00", "315.00", "1470.00"],
      },
      {
        name: "Тара и упаковка",
        cost: ["23.00", "23000.00", "315.00", "930.00"],
      },
    ],
  },
  {
    name: "Услуги",
    cost: ["80.00", "80000.00", "315.00", "2499.80"],
    options: [
      {
        name: "Коммунальные и бытовые услуги",
        cost: ["24.00", "24000.00", "450.00", "650.00"],
      },
      {
        name: "Ритуальные услуги",
        cost: ["220.00", "120000.00", "495.00", "4690.00"],
      },
      {
        name: "Бурение скважин",
        cost: ["42.00", "42000.00", "315.00", "1580.00"],
      },
      {
        name: "Реклама",
        cost: ["71.00", "71000.00", "315.00", "2800.00"],
      },
      {
        name: "Грузчики",
        cost: ["80.00", "80000.00", "720.00", "1490.00"],
      },
      {
        name: "Грузоперевозки",
        cost: ["85.00", "85000.00", "333.00", "3160.00"],
      },
      {
        name: "Курьерские услуги",
        cost: ["16.00", "18000.00", "900.00", "8280.00"],
      },
      {
        name: "Медицина (стоматология, услуги врачей, клиники)",
        cost: ["58.00", "58000.00", "261.00", "2280.00"],
      },
      {
        name: "Психология",
        cost: ["50.00", "50000.00", "720.00", "3190.00"],
      },
      {
        name: "Юридические услуги (регистрация предприятий, консультации и т. д.)",
        cost: ["90.00", "50000.00", "297.00", "3370.00"],
      },
      {
        name: "Типография, полиграфия",
        cost: ["65.00", "65000.00", "180.00", "3970.00"],
      },
      {
        name: "Сервисное обслуживание (ремонт техники, компьютеров и телефонов)",
        cost: ["41.00", "41000.00", "1080.00", "670.00"],
      },
      {
        name: "Красота (фитнес, макияж, косметология, стилист и т. д.)",
        cost: ["45.00", "45000.00", "675.00", "940.00"],
      },
      {
        name: "Охрана и безопасность",
        cost: ["24.00", "24000.00", "270.00", "1920.00"],
      },
      {
        name: "Свадьбы",
        cost: ["112.00", "52000.00", "720.00", "1380.00"],
      },
    ],
  },
  {
    name: "Развлечения и досуг",
    cost: ["30.00", "20000.00", "630.00", "1525.40"],
    options: [],
  },
  {
    name: "Другая тематика",
    cost: ["30.00", "30000.00", "447.30", "1500"],
    options: [],
  },
];

// Полный массив "tasks" с опциями (не меняем, так как это просто коэффициенты)
export const tasks = [
  {
    name: "Увеличить трафик",
    options: [
      { name: "Комплексное продвижение", cost: "1,6" },
      { name: "Поисковая оптимизация (SEO)", cost: "1,3" },
      { name: "Реклама на поиске Яндекс", cost: "1,3" },
      { name: "Продвижение в социальных сетях (SMM)", cost: "1,3" },
      { name: "Видеореклама", cost: "1,3" },
      { name: "Рекламные сети", cost: "1,3" },
    ],
  },
  {
    name: "Привлечь лиды",
    options: [
      { name: "Лидогенерация под ключ", cost: "1,6" },
      { name: "Пакет Напарник", cost: "1,7" },
      { name: "Лид-формы в соцсетях", cost: "1,3" },
      { name: "Повысить качество лидов", cost: "1,3" },
      { name: "Сбор баз", cost: "1,3" },
    ],
  },
  {
    name: "Увеличить продажи",
    options: [
      { name: "Комплексное продвижение", cost: "1,6" },
      { name: "Оптимизация рекламы", cost: "1,3" },
      { name: "Маркетплейсы", cost: "1,3" },
    ],
  },
  {
    name: "Занять ТОП-позиции в поиске",
    options: [
      { name: "Реклама Яндекс (спецразмещение 1-2 место)", cost: "2" },
      { name: "Реклама Яндекс (спецразмещение 2-3 место)", cost: "1,5" },
      { name: "Реклама Яндекс (спецразмещение 3-4 место)", cost: "1,3" },
      { name: "Поисковая оптимизация (SEO)", cost: "1,3" },
    ],
  },
  {
    name: "Продвижение в социальных сетях",
    options: [
      { name: "SMM под ключ", cost: "1,6" },
      { name: "Реклама в Vk", cost: "1,3" },
      { name: "Реклама в OK", cost: "1,3" },
      { name: "Реклама в MyTarget", cost: "1,3" },
    ],
  },
  {
    name: "Имиджевая реклама бренда",
    options: [
      { name: "Видеореклама", cost: "1,3" },
      { name: "Продвижение в социальных сетях", cost: "1,3" },
      { name: "Медийная реклама", cost: "1,3" },
    ],
  },
  {
    name: "Видеореклама",
    options: [
      { name: "Яндекс Директ РСЯ", cost: "2,3" },
      { name: "Видеореклама в соц. сетях", cost: "2,3" },
    ],
  },
  {
    name: "SEO оптимизация",
    options: [
      { name: "SEO под ключ", cost: "1,6" },
      { name: "SEO-аудит сайта", cost: "1,3" },
      { name: "SEO-проектирование", cost: "1,3" },
      { name: "Внутренняя оптимизация сайта", cost: "1,3" },
      { name: "SEO по трафику", cost: "1,3" },
      { name: "SEO по позициям", cost: "1,3" },
      { name: "Продвижение по лидам", cost: "1,3" },
      { name: "Вывод сайта из под фильтров", cost: "1,3" },
      { name: "Управление репутацией (SERM)", cost: "1,3" },
      { name: "Внешняя оптимизация сайта", cost: "1,3" },
      { name: "Нужна консультация", cost: "1,3" },
    ],
  },
  {
    name: "Мобильная реклама",
    options: [
      { name: "Реклама в приложениях", cost: "1,3" },
      { name: "Мессенджеры (Telegram Ads, WhatsApp, Viber)", cost: "1,3" },
      { name: "Реклама в картах и навигаторах", cost: "1,3" },
    ],
  },
  {
    name: "Нужна консультация",
    cost: "1,3",
    options: [],
  },
];

// Полный объект "months"
export const months = {
  "1 месяц": "1,5",
  "3 месяца": "1,2",
  "6 месяцев": "1",
  "12 месяцев": "0,8",
  "Не имеет значения": "1",
};

// Полный объект "assortment"
export const assortment = {
  "Минимальный ассортимент (1 категория товаров или небольшой сайт с несколькими услугами)":
    "0,8",
  "Небольшой ассортимент (до 10 товарных категорий)": "1",
  "Средний ассортимент (до 50 товарных категорий)": "1,1",
  "Большой ассортимент (тысячи позиций)": "1,3",
  "Мегамаркет, агрегатор или маркетплейс": "2",
};

// Полный объект "regions"
export const regions = {
  "Малые города": "0,9",
  "Крупные города": "1,1",
  "Города-миллионники": "1,3",
  Москва: "1,5",
  "Вся Россия": "1,7",
};
